/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50051
Source Host           : localhost:3306
Source Database       : jike

Target Server Type    : MYSQL
Target Server Version : 50051
File Encoding         : 65001

Date: 2015-11-10 12:17:46
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `name` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('admin', 'admin');

-- ----------------------------
-- Table structure for `category`
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category` (
  `tid` int(11) NOT NULL auto_increment,
  `typename` varchar(255) NOT NULL,
  PRIMARY KEY  (`tid`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of category
-- ----------------------------
INSERT INTO `category` VALUES ('1', '社会');
INSERT INTO `category` VALUES ('2', '百家');
INSERT INTO `category` VALUES ('3', '本地');
INSERT INTO `category` VALUES ('4', '娱乐');

-- ----------------------------
-- Table structure for `news`
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news` (
  `id` int(11) NOT NULL auto_increment,
  `tid` int(11) NOT NULL,
  `main_title` varchar(255) NOT NULL,
  `second_abs` varchar(255) NOT NULL,
  `picture` varchar(255) NOT NULL,
  `link` varchar(255) NOT NULL,
  `time` datetime NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=116 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES ('10', '1', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('3', '2', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('4', '1', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('5', '1', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '腾讯任宇昕：这三大趋势将催生无数新产品、新公司和新模', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('6', '1', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('7', '1', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('8', '1', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('11', '1', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('12', '2', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('13', '1', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('14', '1', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('15', '2', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('16', '2', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('17', '2', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '腾讯任宇昕：这三大趋势将催生无数新产品、新公司和新模', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('18', '2', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('19', '2', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('20', '2', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('21', '3', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('22', '3', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('23', '3', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('24', '3', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '腾讯任宇昕：这三大趋势将催生无数新产品、新公司和新模', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('25', '3', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('26', '3', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('27', '3', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('28', '3', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('29', '3', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('30', '3', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('31', '4', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('32', '4', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('33', '4', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('34', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '腾讯任宇昕：这三大趋势将催生无数新产品、新公司和新模', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('35', '4', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('36', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('37', '4', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('38', '4', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('39', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '我是阿里副标题', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('40', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('41', '4', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('42', '4', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('43', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '我是阿里副标题', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('44', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('45', '4', '[洋跟帖]14%的日本女性首次约会想亲热 美网民：不止', '还有人说，我哥们儿在驻日基地勾搭上的远不止这14%。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('46', '4', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('47', '4', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '我是阿里副标题', '3.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('48', '2', '9月结售汇逆差大幅扩至近7000亿元', '9月结售汇逆差大幅扩至近7000亿元', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('49', '2', '小米神话破灭:出货量不敌华为 线下渠道成死穴', '今年第三季度小米智能手机整体出货量为1850万台，华为为2740万台，超小米近900万台。', 'd.jpg', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('50', '2', '疯狂的无人机：大疆日子会越来越难过 小米和数百创业公司将围剿', '大疆将原来的纯工业级无人机，带向了消费级无人机和工业级无人机并存的阶段。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('51', '2', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '腾讯任宇昕：这三大趋势将催生无数新产品、新公司和新模', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('52', '1', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '喜欢警匪片的该知道：中国最重要的国际刑警去世了', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('53', '1', '阿里若收购新浪，百度会笑，京东腾讯该哭了', '坊间流传着一个段子。', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('54', '1', '习主席访英，他的朋友圈都晒什么？', '如果习主席也有朋友圈，是不是这样的？', 'd.jpg', 'd', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('55', '1', '99十八届五中全会明日召开 看点抢先看', '习近平主席访问英国是中国元首10年来首次对英国国事访问，也是中国向欧洲的又一次重大外交行动。从...', '', '#', '2015-11-07 04:02:50');
INSERT INTO `news` VALUES ('98', '1', 'mei', 'sdf', '', '#', '2015-11-08 14:36:42');
INSERT INTO `news` VALUES ('114', '4', '4443米', '444', 'd.jpg', '#', '2015-11-09 22:30:18');
